app/views/users/_userevents.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = 2
---
<% if @user.events.any? %>