app/views/users/show.html.erb


  <% if @user.events.any? %>
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = 1 ORDER BY events.created_at DESC
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = 5