app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY events.created_at DESC
---
  def index
    @events = Event.all

SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY events.created_at DESC LIMIT 1  [["id", "2"]]
---
  def show
    @event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY events.created_at DESC LIMIT 1  [["id", "2"]]
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("church_id", "created_at", "description", "end_time", "location", "name", "start_time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@event = Event.current_user.events.build(params[:event])
    @event = current_user.events.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY events.created_at DESC LIMIT 1  [["id", "4"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 4]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy