app/controllers/users_controller.rb

INSERT INTO "users" ("admin", "church", "created_at", "email", "location", "password_digest", "religion", "remember_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save